/*
   HOW TO SETUP Modern OpenGl!

   GLFW and GLEW have to be setup.

   Where does the glew32.dll go?  Doesn't, link against the glew32s.lib

   VERY IMPORTANT: In preferences: C/C++ -> Preprocessor -> Preprocessor Definitions (add) GLEW_STATIC in the ; delimited list!

   GL/glew.h contains the main glMethods(...)

   Link to all the *.lib files as needed and include all the header *.h files.

   1) READ THE DOCUMENTATION ON THE LIBRARIES
   2) KNOW YOUR IDE AND HOW TO SET IT UP
*/



#include <GL/glew.h>        // Cross platform link between your graphics card and OpenGL.
#include <GLFW/glfw3.h>

//#define GLM_FORCE_INLINE
#include "glm/glm.hpp"
#include "glm/gtc/matrix_transform.hpp"

#include <iostream>
#include <fstream>
#include <string>
#include <sstream>
#include <chrono>
#include <thread>
#include <ctime>

#include "ux/ux.h"

#include "glfont/GLFont.h";
#include "glfont/FTLabel.h";

#include "OBJ_Loader.h"

#include "UniformBuffer.hpp"


#include "imgui/imgui.h"
#include "imgui/imgui_impl_glfw.h"
#include "imgui/imgui_impl_opengl3.h"

#include "entt/entt.hpp"

#include <irrklang/irrKlang.h>



glm::ivec2 origWindowSize, windowSize;
glm::ivec2 windowPosition;

glm::ivec2 origFramebufferSize, framebufferSize;
float ratio;


void window_pos_callback(GLFWwindow* window, int xpos, int ypos)
{
    //std::cout << "Window Pos: " << xpos << " " << ypos << std::endl;
    windowPosition.x = xpos;
    windowPosition.y = ypos;
}


    // glDrawArrays) this variable holds the number of the currently processed vertex since the start of the render call.

    // Fragment shader variables
    // gl_FragCoord, gl_FrontFacing, gl_FragDepth



    auto cube = ux::Cube(glm::vec3(1.0f));

    auto segment = ux::Segment(0.5f, 1.0f, 0.0f, 45.0f, 0.125f);

    auto segment2 = ux::Segment(1.25f, 1.5f, 0.0f, 15.0f, 0.125f);

    float color_front[4] = { 1.0f, 1.0f, 1.0f, 1.0f };







    auto shader = Shader("res/shaders/basic.shader");

    //auto texture = Texture("res/textures/cartographer-logo-600x600.png");
    //texture.Bind();
    //shader.SetUniform1i("u_Texture", 0);

    auto shaderQuad = Shader("res/shaders/quad.shader");

    auto shaderBox = Shader("res/shaders/box.shader");

    auto shaderBase = Shader("res/shaders/base.shader");

    auto shaderText = Shader("res/shaders/text.shader");

    auto shaderUX = Shader("res/shaders/ux.shader");



    glm::vec3 axis = { 0.0, 0.0, 0.0 };

    // all object in the scene are scaled by scale
    float scale = 25.0; //1.0; //0.125;


    glm::vec3 translate = { -1.4, 0.0, 0.0 };

    glm::vec3 mRotate = { 0.5, 0.0, 2.0 };
    float zNear = 0.01f;
    float zFar = 2000.0;

    float rotator = 0.0;
    float rotator_increment = 0.0; //0.001;

    // lighting
    glm::vec3 lightPos = glm::vec3(-24.0, 1.0, 1.0);
    glm::vec3 lightInc = glm::vec3(0.045, 0.0, 0.0);


    float translateZ = -100.0;
    glm::vec2 rotateXY = glm::vec2(0.0, glm::radians(0.0));


    glm::vec4 color = { 0.2, 0.2, 0.2, 1.0 };
    glm::vec4 light_color = { 1.0, 1.0, 1.0, 1.0 };
    glm::vec4 light_ambient = { 0.2, 0.2, 0.2, 1.0 };
    glm::vec4 light_diffuse = { 0.5, 0.5, 0.5, 1.0 };
    glm::vec4 light_specular = { 0.2, 0.2, 0.2, 1.0 };

    glm::vec3 camera_position = { 0.0, 0.0, 10.0 };
    glm::vec3 camera_look_at = { 0.0, 0.0, 0.0 };

    float gamma = 1.0;
    bool animate = true;
    bool show_text = true;

    //float ambient_strength = 0.1;
    //float specular_strength = 0.5;
    float specular_shininess = 32.0;

    glm::vec4 ambient_color = { 0.348f, 0.348f, 0.348f, 1.0f };
    glm::vec4 diffuse_color = { 0.608f, 0.608f, 0.608f, 1.0f };
    glm::vec4 specular_color = { 0.5f, 0.5f, 0.5f, 1.0f };


    glm::mat4 proj = glm::perspective(glm::radians(55.0f), (float)ratio, zNear, zFar); // PROJECTION (SCREEN)

    glm::mat4 viewBase = glm::lookAt(camera_position,     // Camera position in world space
        camera_look_at,      // look at origin
        glm::vec3(0, 1, 0)); // Head is up (set to 0, -1, 0 to look upside down)

    glm::mat4 viewTranslate = glm::translate(viewBase, glm::vec3(0.0, 0.0, translateZ));
    glm::mat4 viewRotateX = glm::rotate(viewTranslate, rotateXY.x, glm::vec3(1.0, 0.0, 0.0));
    glm::mat4 view = glm::rotate(viewRotateX, rotateXY.y, glm::vec3(0.0, 1.0, 0.0)); // CAMERA

    // If w == 0, the value stored is a vector, if w == 1, the value stored is a point. 

    glm::vec4 cp = glm::vec4(camera_position, 1.0);
    glm::vec4 cla = glm::vec4(camera_look_at, 1.0);
    //glm::vec4 lp = glm::vec4(lightPos, 1.0);

    typedef struct Awesome
    {
        glm::vec4      ux_color;               // 16
        // material
        glm::vec4      ux_ambient_color;       // 16
        glm::vec4      ux_diffuse_color;       // 16
        glm::vec4      ux_specular_color;      // 16
        float          ux_specular_shininess;  // 16 (4)
        float          padding1[3];
        // camera
        glm::vec4      ux_camera_position;     // 16
        glm::vec4      ux_camera_look_at;      // 16
        // light
        glm::vec4      ux_light_pos;           // 16 (12)
        //float          padding2[1];
        glm::vec4      ux_light_color;         // 16
        glm::vec4      ux_light_ambient;       // 16
        glm::vec4      ux_light_diffuse;       // 16
        glm::vec4      ux_light_specular;      // 16
        // core matrix(s)
        glm::mat4      ux_view;                // 64
        glm::mat4      ux_proj;                // 64
        // post-production
        float          ux_gamma;               // 16 (4)
        float          padding3[3];
    };

    typedef struct Light
    {

    };

    typedef struct Super
    {
        glm::vec4 s_color1;
        glm::vec4 s_color2;
    };

    typedef struct Pooper
    {
        glm::mat4 view;
        glm::mat4 proj;
    };

    Awesome awesome = {
        //                 (shader var name)         (type) (off) (sz)
        color,              // ux_color               vec4   0     16
        // material
        ambient_color,      // ux_ambient_color       vec4   16    16
        diffuse_color,      // ux_diffuse_color       vec4   32    16
        specular_color,     // ux_specular_color      vec4   48    16
        specular_shininess, // ux_specular_shininess  float  64    16  (4)
        {0.0f, 0.0f, 0.0f },
        // camera
        cp,                 // ux_camera_position     vec3   80    16
